Ran Plan for project: `atoca-house` dir: `terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # cloudflare_record.subdomain["bazar"] must be replaced
-/+ resource "cloudflare_record" "subdomain" {
+       allow_overwrite = false
!       created_on      = "2023-10-04T19:31:20.868206Z" -> (known after apply)
!       hostname        = "bazar.atoca.house" -> (known after apply)
!       id              = "ef1cbce2b57df636fde301257de5a272" -> (known after apply)
!       metadata        = {
-           "auto_added"             = "false"
-           "managed_by_apps"        = "false"
-           "managed_by_argo_tunnel" = "false"
        } -> (known after apply)
!       modified_on     = "2023-10-04T19:31:20.868206Z" -> (known after apply)
!       name            = "bazar" -> "bazar.atoca.house" # forces replacement
!       proxiable       = false -> (known after apply)
-       tags            = [] -> null
!       ttl             = 1 -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
!       value           = (sensitive value)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
!       zone_id         = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # cloudflare_record.subdomain["cloud"] must be replaced
-/+ resource "cloudflare_record" "subdomain" {
+       allow_overwrite = false
!       created_on      = "2024-05-08T19:46:32.098861Z" -> (known after apply)
!       hostname        = "cloud.atoca.house" -> (known after apply)
!       id              = "eef8eebb81023439fc3bc073273448ad" -> (known after apply)
!       metadata        = {
-           "auto_added"             = "false"
-           "managed_by_apps"        = "false"
-           "managed_by_argo_tunnel" = "false"
        } -> (known after apply)
!       modified_on     = "2024-05-08T19:46:32.098861Z" -> (known after apply)
!       name            = "cloud" -> "cloud.atoca.house" # forces replacement
!       proxiable       = false -> (known after apply)
-       tags            = [] -> null
!       ttl             = 1 -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
!       value           = (sensitive value)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
!       zone_id         = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # cloudflare_record.subdomain["comp-netdata"] must be replaced
-/+ resource "cloudflare_record" "subdomain" {
+       allow_overwrite = false
!       created_on      = "2023-07-06T12:36:45.17941Z" -> (known after apply)
!       hostname        = "comp-netdata.atoca.house" -> (known after apply)
!       id              = "e13d59c857b364e4fc5779f3b543d483" -> (known after apply)
!       metadata        = {
-           "auto_added"             = "false"
-           "managed_by_apps"        = "false"
-           "managed_by_argo_tunnel" = "false"
        } -> (known after apply)
!       modified_on     = "2023-07-06T12:38:33.029147Z" -> (known after apply)
!       name            = "comp-netdata" -> "comp-netdata.atoca.house" # forces replacement
!       proxiable       = false -> (known after apply)
-       tags            = [] -> null
!       ttl             = 1 -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
!       value           = (sensitive value)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
!       zone_id         = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # cloudflare_record.subdomain["compartilhado"] must be replaced
-/+ resource "cloudflare_record" "subdomain" {
+       allow_overwrite = false
!       created_on      = "2022-02-21T08:10:59.12871Z" -> (known after apply)
!       hostname        = "compartilhado.atoca.house" -> (known after apply)
!       id              = "04f9f7ef0f73529e513c02b8f088a739" -> (known after apply)
!       metadata        = {
-           "auto_added"             = "false"
-           "managed_by_apps"        = "false"
-           "managed_by_argo_tunnel" = "false"
        } -> (known after apply)
!       modified_on     = "2022-02-21T08:10:59.12871Z" -> (known after apply)
!       name            = "compartilhado" -> "compartilhado.atoca.house" # forces replacement
!       proxiable       = false -> (known after apply)
-       tags            = [] -> null
!       ttl             = 1 -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
!       value           = (sensitive value)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
!       zone_id         = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # cloudflare_record.subdomain["home"] must be replaced
-/+ resource "cloudflare_record" "subdomain" {
+       allow_overwrite = false
!       created_on      = "2022-02-22T15:31:09.076671Z" -> (known after apply)
!       hostname        = "home.atoca.house" -> (known after apply)
!       id              = "39bf465d252a23b4cedd3b27a494cf37" -> (known after apply)
!       metadata        = {
-           "auto_added"             = "false"
-           "managed_by_apps"        = "false"
-           "managed_by_argo_tunnel" = "false"
        } -> (known after apply)
!       modified_on     = "2022-02-22T15:31:09.076671Z" -> (known after apply)
!       name            = "home" -> "home.atoca.house" # forces replacement
!       proxiable       = false -> (known after apply)
-       tags            = [] -> null
!       ttl             = 1 -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
!       value           = (sensitive value)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
!       zone_id         = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # cloudflare_record.subdomain["jacket"] must be replaced
-/+ resource "cloudflare_record" "subdomain" {
+       allow_overwrite = false
!       created_on      = "2022-09-27T19:41:15.158872Z" -> (known after apply)
!       hostname        = "jacket.atoca.house" -> (known after apply)
!       id              = "55435ff7f1472f2e19083cd6d0fdaa32" -> (known after apply)
!       metadata        = {
-           "auto_added"             = "false"
-           "managed_by_apps"        = "false"
-           "managed_by_argo_tunnel" = "false"
        } -> (known after apply)
!       modified_on     = "2022-09-27T19:41:15.158872Z" -> (known after apply)
!       name            = "jacket" -> "jacket.atoca.house" # forces replacement
!       proxiable       = false -> (known after apply)
-       tags            = [] -> null
!       ttl             = 1 -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
!       value           = (sensitive value)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
!       zone_id         = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # cloudflare_record.subdomain["jellyfin"] must be replaced
-/+ resource "cloudflare_record" "subdomain" {
+       allow_overwrite = false
!       created_on      = "2023-04-03T09:02:18.138333Z" -> (known after apply)
!       hostname        = "jellyfin.atoca.house" -> (known after apply)
!       id              = "0601582fac72dd6563b55be84591ff16" -> (known after apply)
!       metadata        = {
-           "auto_added"             = "false"
-           "managed_by_apps"        = "false"
-           "managed_by_argo_tunnel" = "false"
        } -> (known after apply)
!       modified_on     = "2023-04-03T09:02:18.138333Z" -> (known after apply)
!       name            = "jellyfin" -> "jellyfin.atoca.house" # forces replacement
!       proxiable       = false -> (known after apply)
-       tags            = [] -> null
!       ttl             = 1 -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
!       value           = (sensitive value)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
!       zone_id         = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # cloudflare_record.subdomain["kuma"] must be replaced
-/+ resource "cloudflare_record" "subdomain" {
+       allow_overwrite = false
!       created_on      = "2022-09-19T19:51:34.68516Z" -> (known after apply)
!       hostname        = "kuma.atoca.house" -> (known after apply)
!       id              = "efa76ae57275c906695475c776537c15" -> (known after apply)
!       metadata        = {
-           "auto_added"             = "false"
-           "managed_by_apps"        = "false"
-           "managed_by_argo_tunnel" = "false"
        } -> (known after apply)
!       modified_on     = "2022-09-19T19:51:34.68516Z" -> (known after apply)
!       name            = "kuma" -> "kuma.atoca.house" # forces replacement
!       proxiable       = false -> (known after apply)
-       tags            = [] -> null
!       ttl             = 1 -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
!       value           = (sensitive value)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
!       zone_id         = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # cloudflare_record.subdomain["npm"] must be replaced
-/+ resource "cloudflare_record" "subdomain" {
+       allow_overwrite = false
!       created_on      = "2022-09-19T19:50:59.206473Z" -> (known after apply)
!       hostname        = "npm.atoca.house" -> (known after apply)
!       id              = "6086346d0cf4731ce70f51f28f63224c" -> (known after apply)
!       metadata        = {
-           "auto_added"             = "false"
-           "managed_by_apps"        = "false"
-           "managed_by_argo_tunnel" = "false"
        } -> (known after apply)
!       modified_on     = "2022-09-19T19:50:59.206473Z" -> (known after apply)
!       name            = "npm" -> "npm.atoca.house" # forces replacement
!       proxiable       = false -> (known after apply)
-       tags            = [] -> null
!       ttl             = 1 -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
!       value           = (sensitive value)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
!       zone_id         = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # cloudflare_record.subdomain["portainer"] must be replaced
-/+ resource "cloudflare_record" "subdomain" {
+       allow_overwrite = false
!       created_on      = "2022-10-14T12:11:40.849341Z" -> (known after apply)
!       hostname        = "portainer.atoca.house" -> (known after apply)
!       id              = "a8e6bf11a1a69960251cae8129a9731c" -> (known after apply)
!       metadata        = {
-           "auto_added"             = "false"
-           "managed_by_apps"        = "false"
-           "managed_by_argo_tunnel" = "false"
        } -> (known after apply)
!       modified_on     = "2022-10-14T12:11:40.849341Z" -> (known after apply)
!       name            = "portainer" -> "portainer.atoca.house" # forces replacement
!       proxiable       = false -> (known after apply)
-       tags            = [] -> null
!       ttl             = 1 -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
!       value           = (sensitive value)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
!       zone_id         = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # cloudflare_record.subdomain["radar"] must be replaced
-/+ resource "cloudflare_record" "subdomain" {
+       allow_overwrite = false
!       created_on      = "2022-02-21T08:10:18.490153Z" -> (known after apply)
!       hostname        = "radar.atoca.house" -> (known after apply)
!       id              = "718beccbd211ce2c023e82cafd3d93b5" -> (known after apply)
!       metadata        = {
-           "auto_added"             = "false"
-           "managed_by_apps"        = "false"
-           "managed_by_argo_tunnel" = "false"
        } -> (known after apply)
!       modified_on     = "2022-02-21T08:10:18.490153Z" -> (known after apply)
!       name            = "radar" -> "radar.atoca.house" # forces replacement
!       proxiable       = false -> (known after apply)
-       tags            = [] -> null
!       ttl             = 1 -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
!       value           = (sensitive value)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
!       zone_id         = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # cloudflare_record.subdomain["readar"] must be replaced
-/+ resource "cloudflare_record" "subdomain" {
+       allow_overwrite = false
!       created_on      = "2024-05-08T19:19:37.044249Z" -> (known after apply)
!       hostname        = "readar.atoca.house" -> (known after apply)
!       id              = "07553b0794776a81221fea8caaad318a" -> (known after apply)
!       metadata        = {
-           "auto_added"             = "false"
-           "managed_by_apps"        = "false"
-           "managed_by_argo_tunnel" = "false"
        } -> (known after apply)
!       modified_on     = "2024-05-08T19:19:37.044249Z" -> (known after apply)
!       name            = "readar" -> "readar.atoca.house" # forces replacement
!       proxiable       = false -> (known after apply)
-       tags            = [] -> null
!       ttl             = 1 -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
!       value           = (sensitive value)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
!       zone_id         = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # cloudflare_record.subdomain["sonar"] must be replaced
-/+ resource "cloudflare_record" "subdomain" {
+       allow_overwrite = false
!       created_on      = "2023-01-16T19:37:40.989973Z" -> (known after apply)
!       hostname        = "sonar.atoca.house" -> (known after apply)
!       id              = "b2d4a33ac7dfb0eff91ff8c1a95cc3bf" -> (known after apply)
!       metadata        = {
-           "auto_added"             = "false"
-           "managed_by_apps"        = "false"
-           "managed_by_argo_tunnel" = "false"
        } -> (known after apply)
!       modified_on     = "2023-01-16T19:37:40.989973Z" -> (known after apply)
!       name            = "sonar" -> "sonar.atoca.house" # forces replacement
!       proxiable       = false -> (known after apply)
-       tags            = [] -> null
!       ttl             = 1 -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
!       value           = (sensitive value)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
!       zone_id         = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # cloudflare_record.subdomain["transmission"] must be replaced
-/+ resource "cloudflare_record" "subdomain" {
+       allow_overwrite = false
!       created_on      = "2022-02-21T08:10:42.618588Z" -> (known after apply)
!       hostname        = "transmission.atoca.house" -> (known after apply)
!       id              = "4171c1be6dee6ecced3e83cae78700d5" -> (known after apply)
!       metadata        = {
-           "auto_added"             = "false"
-           "managed_by_apps"        = "false"
-           "managed_by_argo_tunnel" = "false"
        } -> (known after apply)
!       modified_on     = "2022-02-21T08:10:42.618588Z" -> (known after apply)
!       name            = "transmission" -> "transmission.atoca.house" # forces replacement
!       proxiable       = false -> (known after apply)
-       tags            = [] -> null
!       ttl             = 1 -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
!       value           = (sensitive value)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
!       zone_id         = (sensitive value)
        # (3 unchanged attributes hidden)
    }

Plan: 14 to add, 0 to change, 14 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p atoca-house
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.atoca.house/lock?id=guilhermewolf%252Fatoca.house%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p atoca-house
  ```
Plan: 14 to add, 0 to change, 14 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```